Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: As expected, the expression (fun x : Nat => x) 1 has type Nat.
ko: 예상했다시피 표현식(fun x : Nat => x) 1 은 Nat 유형을 갖습니다.

source: As in Lean 3, the notation is activated using parentheses, and the lambda abstraction is created by collecting the nested ·s.
ko: 린 3에서처럼 표기는 괄호를 사용해 활성화되고 람다 추상화는 중첩된 ·의 모음으로 만들어집니다.

source: As mentioned above, the notation command allows us to define arbitrary mixfix syntax freely mixing tokens and placeholders.
ko: 위에서 언급한 대로, notation 명령은 우리가 임의의 자유롭게 토큰과 자리차지자를 혼합한 mixfix 문법을 정의하도록 합니다.

source: As noted above, the type class instances in a given context represent a Prolog-like program, which gives rise to a backtracking search.
ko: 위에서 언급했듯이 주어진 상황의 유형 클래스 개체는 역추적 검색을 발생시키는 Prolog와 유사한 프로그램을 나타냅니다.

source: As observed above, the induction principle is just a special case of the recursion principle, when the codomain motive n is an element of Prop.
ko: 위에서 봤듯이 공동역역 motive n이 Prop의 원소일 때 귀납 원리는 재귀 원리의 특별한 경우일 뿐입니다.

source: As the apply tactic is a command for constructing function applications interactively, the intro tactic is a command for constructing function abstractions interactively (i.e., terms of the form fun x => e).
ko: apply 전략이 함수의 활용을 상호작용으로 만드는 명령인 것처럼 intro 전략은 상호작용 방식으로 함수 추상화를 만드는 명령입니다. (예, fun x => e꼴의 항들).

source: As the example above suggests, you have already seen an example of a function of type Type → Type → Type, namely, the Cartesian product Prod:
ko: 위 예에서 제안한 것처럼 여러분은 이미 주로 카테시안 곱 Prod에서 Type → Type → Type 유형의 함수의 예를 보았습니다.

source: As the second example shows, the contradiction tactic also detects contradictions of this form.
ko: 두 번째 예제가 보여주다시피 contradiction 전략도 이 형태의 모순을 감지합니다.

source: As usual, the constructors are kept in a namespace that is named after the type being defined, and the command open even odd allows us to access them move conveniently.
ko: 평소처럼, 생성자는 유형이 정의된 이름을 딴 이름공간에 남아있고, 명령 open even odd는 우리가 그들에게 더 편리하게 접근하도록 해줍니다.

source: As usual, you can avoid the prefix Point by using the command open Point.
ko: 평소처럼 여러분은 open Point명령을 사용해 접두사 Point를 생략할 수 있습니다.

source: As was the case for implication, the propositions-as-types interpretation now comes into play.
ko: 함의의 경우 때와 같이 유형으로써 명제 해석은 이제 제 역할을 하기 시작했습니다.

source: As we have seen, a pattern is either a variable, a constructor applied to other patterns, or an expression that normalizes to something of that form (where the non-constructors are marked with the [matchPattern] attribute).
ko: 우리가 봤던 것처럼 패턴은 생성자가 다른 패턴을 적용한 변수이거나 그 형태를 무언가로 정규화한 표현식입니다. (여기서 비생성자는 [matchPattern] 속성으로 표시되었습니다.)

source: As we mentioned above, the argument {n : Nat} is part of the pattern matching, because it cannot be held fixed throughout the definition.
ko: 위에서 언급했듯이 인수 {n : Nat}은 패턴 매칭의 일부입니다. 왜냐하면 이것은 정의 전체에 대해 고정될 수 없기 때문입니다.

source: As we saw in the last section, the terms t₁, ..., tₙ can make use of any of the parameters a, as well as any of the variables that are introduced in the corresponding patterns.
ko: 우리가 지난 섹션에서 보았듯이, 항 t₁, ..., tₙ은 대응되는 패턴에서 도입된 임의의 변수 뿐만 아니라 임의의 매개변수 a를 사용할 수 있게 만듭니다.

source: As we will discuss further in Attributes, one can limit the scope of an attribute to the current file or section using the local modifier:
ko: Attributes에서 더 논의할 것이지만 누군가는 local 수정자를 사용해 특성의 범위를 현재 파일이나 섹션으로 제한할 수 있습니다.

source: As with have, you can leave the type implicit by writing let a := 3 * 2.
ko: have처럼 여러분은 let a:= 3 * 2와 같이 작성하여 유형을 암시적으로 정해지게 둘 수 있습니다.

source: As with rewrite, you can send simp a list of facts to use, including general lemmas, local hypotheses, definitions to unfold, and compound expressions.
ko: rewrite처럼 여러분은 simp를 일반적인 보조정리, 국부적인 가정, 펼쳐지지 않은 정의와 복합 표현식을 포함한 사실들의 리스트를 사용하도록 보낼 수 있습니다.

source: As with rw, you can use the keyword at to simplify a hypothesis:
ko: rw처럼 여러분은 키워드 at으로 가정을 간단히 하는데 사용합니다.

source: As with definition by pattern matching, parameters to a structural recursion or induction may appear before the colon.
ko: 패턴 매칭의 정의에서처럼 구조적 재귀나 귀납에 대한 매개변수는 콜론 앞에 나타날 수 있습니다.

source: As with definitions, the #print command will show you the proof of a theorem.
ko: 정의와 마찬가지로 #print명령은 정리의 증명을 여러분에게 보여줄 것 입니다.

source: As with function definitions, Lean's inductive definition syntax will let you put named arguments to the constructors before the colon:
ko: 함수 정의에서 처럼 린의 유도 정의 문법은 여러분이 이름붙은 인수를 콜론 앞에 생성자에 놓게 할 겁니다.

source: As with lambda abstraction notation, the intro tactic allows us to use an implicit match.
ko: 람다 추상화 기호처럼 intro 전략은 암시적인 match를 쓸 수 있도록 해줍니다.

source: As with ordinary definitions, we can move the lambda-abstracted variables to the left of the colon:
ko: 평범한 정의처럼 우리는 람다 추상화된 변수를 콜론의 왼쪽으로 옮길 수 있습니다.

source: As with proof terms, you can omit the label in the have tactic, in which case, the default label this is used:
ko: 증명항과 마찬가지로 여러분은 have 전략 속에 레이블을 생략할 수 있습니다. 그 경우 기본 레이블로 this가 사용됩니다.

source: As with the propositional connectives, in systems of natural deduction, "forall" is governed by an introduction and elimination rule.
ko: 명제적 연결사와 마찬가지로 자연 연역에서 "모든"은 도입과 제거 규칙에 지배받습니다.

source: As with the logical connectives, every inductive type comes with introduction rules, which show how to construct an element of the type, and elimination rules, which show how to "use" an element of the type in another construction.
ko: 논리 연결사와 마찬가지로 모든 귀납형은 유형의 원소를 어떻게 생성하는지 보여주는 도입 규칙과 또다른 생성에서 유형의 원소를 어떻게 "사용"하는지 보여주는 제거 규칙을 동반합니다.

source: As you should by now expect, the library includes both an introduction rule and an elimination rule.
ko: 지금 예상한 대로 라이브러리는 도입 규칙과 소거 규칙 둘 다 가지고 있습니다.

source: Ascii
ko: 아스키(Ascii)

source: Associativity:
ko: 결합성:

source: Assuming that expression occurs in the goal, the cases tactic will generalize over the expression, introduce the resulting universally quantified variable, and case on that.
ko: 표현식이 목표에서 나타남을 가정하면, cases 전략은 표현식을 일반화하고 결과적으로 보편적으로 정량화된 변수를 도입하고 이에 대한 경우를 나눕니다.

source: At that point, simp applies reflexivity to finish it off.
ko: 이점에서 simp는 이를 끝내는데 반사성을 적용합니다.

source: At this point, we see that we need another supporting fact, namely, that succ (n + m) = succ n + m.
ko: 이 시점에서 우리는 또다른 지지하는 사실 succ (n + m) = succ n + m이 필요함을 알게 됩니다.

source: At times, you may find that the type class inference fails to find an expected instance, or, worse, falls into an infinite loop and times out.
ko: 때때로 유형 클래스 추론이 예상한 인스턴스를 찾지 못하거나 더 심하게는 무한 루프에 빠져 시간이 초과되는 것을 발견할 수 있습니다.

source: Attributes
ko: 특성

source: Auto Bound Implicit Arguments
ko: 자동적으로 구속된 암시적인 인자

source: Automated reasoning systems strive for power and efficiency, often at the expense of guaranteed soundness.
ko: 자동화된 추론 시스템은 종종 건전성 보장을 희생해서라도 성능과 효율성을 끌어올리기 위해 애쓰고 있습니다.

source: Axiomatic Details
ko: 공리적 세부사항

source: Basic Tactics
ko: 기본 전략들

source: Basic navigation and rewriting
ko: 기본 탐색 및 다시쓰기

source: Be careful: repeat (try t) will loop forever, because the inner tactic never fails.
ko: 조심하세요. repeat (try t)는 내부 전략은 항상 실패하기 때문에 무한루프를 돌 것입니다.

source: Be careful: not every generalization preserves the validity of the goal.
ko: 조심하세요. 모든 일반화가 목표의 유효성을 보존하지는 않습니다.

source: Because Or has two constructors, we cannot use anonymous constructor notation.
ko: Or은 두 개의 생성자가 있기 때문에 우리는 익명 생성자 표기를 사용할 수 없습니다.

source: Because addition and the zero notation have been assigned the [matchPattern] attribute, they can be used in pattern matching.
ko: 왜냐하면 덧셈과 0 기호는 [matchPattern] 특성이 할당되어 있기에 그들은 패턴 매칭에 사용될 수 있습니다.

source: Because equational reasoning is so common and important, Lean provides a number of mechanisms to carry it out more effectively.
ko: 방정식적인 추론은 꽤 흔하고 중요하기 때문에 린은 그것을 더 효과적으로 수행하는 다수의 메커니즘을 제공합니다.

source: Because fully detailed axiomatic proofs are so complicated, the challenge of theorem proving is to have the computer fill in as many of the details as possible.
ko: 완전히 상세한 공리적 증명은 너무 복잡하기 때문에, 증명 보조기의 문제점은 컴퓨터에 가능한 많이 상세한 것들을 두어야 한다는 것입니다.

source: Because the constructors are polymorphic over types, we have to insert the type Nat as an argument repeatedly.
ko: 생성자들이 유형에 대해 다형적이기 때문에, 우리는 유형 Nat를 인수로써 반복적으로 삽입해야 합니다.

source: Behind the scenes, these descriptions are "compiled" down to primitive recursors, using a procedure that we refer to as the "equation compiler." The equation compiler is not part of the trusted code base; its output consists of terms that are checked independently by the kernel.
ko: 막의 뒤에서 이 설명은 "방정식 컴파일러"라고 부르는 절차를 사용하여 기초적인 재귀자로 "컴파일되어" 내려갑니다. 방정식 컴파일러는 신뢰받는 코드 기반의 일부가 아닙니다. 그것의 출력은 커널에 의해 독립적으로 검증된 항으로 구성됩니다.

source: Below we will see that Lean's editor modes can also help you find things you need, but studying the contents of the library directly is often unavoidable.
ko: 아래에서 우리는 린의 편집기 모드는 여러분이 필요한 것을 찾도록 돕는 것을 봅니다. 그러나 라이브러리의 내용을 공부하는 것은 대게 불가피합니다.

source: Both the efficiency of the program and the solutions that are found can depend on the order in which the system tries the instance.
ko: 프로그램의 효율성과 발견된 해결책은 모두 시스템이 개체를 시도하는 순서에 따라 달라질 수 있습니다.

source: Both expressions denote the type of functions that take a natural number as input and return a natural number as output.
ko: 두 표현식 모두 자연수를 입력으로 받아 자연수를 출력으로 반환하는 함수 유형을 가리킵니다.

source: Both versions are actually notationally convenient abbreviations for a more long-winded expression, Exists (fun x : α => p x), defined in Lean's library.
ko: 두 버전 다 린의 라이브러리에 정의된 길고 장황한 표현식 Exists (fun x : α => p x)을 위한 기호적으로 편리한 약어입니다.

source: But complicated definitions may use several nested casesOn applications, and may be hard to read and understand.
ko: 그러나 복잡해진 정의는 몇 단계로 중첩하여 casesOn를 사용할 수도 있습니다. 그리고 읽고 이해하기 어렵게 될 것입니다.

source: But first, in this chapter, we take a break from the mechanics of type theory to explore some pragmatic aspects of interacting with Lean.
ko: 그러나 우선 이 장에서 우리는 유형론의 원리로부터 떨어져서 린과 상호작용하는 것에 대한 실용적인 면을 탐색해봅시다

source: But for straightforward constructions like the one above, when the type of h and the goal of the construction are salient, the notation is clean and effective.
ko: 위와 같은 간단한 구성의 경우 h의 유형과 구성의 목표가 두드러질 때 이 표기법은 깨끗하고 효과적입니다.

source: But these universe levels do have a bearing on the elimination rule.
ko: 그러나 이 세계 수준은 제거 규칙으로부터 영향을 받습니다.

source: But wherever a term is expected, Lean allows us to insert instead a by <tactics> block, where <tactics> is a sequence of commands, separated by semicolons or line breaks.
ko: 그러나 항이 예상되는 어디든지 린은 우리가 by <tactics> 블록 대신 <tactics>이 세미콜론이나 줄 분리자로 나눠진 일련의 명령들을 삽입하게 해줍니다.

source: But revert is even more clever, in that it will revert not only an element of the context but also all the subsequent elements of the context that depend on it.
ko: 그러나 revert는 맥락 속 요소들 뿐만 아니라 그에 의존하는 맥락의 뒤에 올 모든 요소를 되돌려 놓는 다는 점에서 아주 영리합니다.

source: But Lean handles the ambiguity by using the first applicable equation, so in this example the net result is the same.
ko: 그러나 린은 활용할 수 있는 첫 방정식을 사용하여 모호성을 해소합니다. 그래서 이 예제에서 최종 결과는 같습니다.

source: But because the notion of an inductive type is so fundamental, we feel it is important to start with a low-level, hands-on understanding.
ko: 그러나 귀납형의 개념은 너무 근본적이라 우리는 저수준의 실습 이해부터 시작하는 것이 중요하다고 느낍니다.

source: But if we use the classical principle, say, to define a function by cases, that function will not be computable.
ko: 그러나 우리가 고전 원리를 사용해 경우에 따라 함수를 정의하면 그 함수는 계산 불가일 겁니다.

source: But it is very useful for building long proofs incrementally.
ko: 하지만 이것은 긴 증명을 점진적으로 만들어 나갈 때 유용합니다.

source: But notice that we have to manually disable the implicit arguments in th1, th2, and euclr, because otherwise too many implicit arguments are inserted.
ko: 하지만 th1과 th2, euclr에서 암시적인 인수를 수동적으로 이 기능을 해제했음을 보세요. 그렇지 않으면 너무 많은 암시적인 인수가 삽입됩니다.

source: But some commands have other effects on the environment, either assigning attributes to objects in the environment, defining notation, or declaring instances of type classes, as described in Chapter Type Classes.
ko: 그러나 환경 속 대상에 특성을 할당하는 것이나 기호를 정의하는 것 또는Chapter Type Classes에서 설명할 유형 클래스의 개체를 선언하는 것으로 몇 가지 명령은 환경에 대해 다른 영향을 받습니다.

source: But sometimes you will want to leave this information protected by a fully qualified name, for example, when they conflict with identifiers in another namespace you want to use.
ko: 그러나 때로는 당신이 사용할 다른 이름공간과 식별자가 충돌할 때 여러분이 이 정보가 완전히 자격을 갖춘 이름으로 보호되길 원할 것입니다.

source: But the act of opening a namespace, which provides shorter names, does not carry over.
ko: 그러나 더 짧은 이름을 제공하는 이름공간을 여는 동작은 앞에서처럼 다른 파일에 영향을 주지 못합니다.

source: But the simplifier detects identities that permute their arguments, and uses a technique known as ordered rewriting.
ko: 그러나 단순화기는 항등식들이 그들의 인자를 교환한다는 것을 감지합니다. 그리고 ordered rewriting으로 알려진 기법을 사용합니다.

source: But there is no reason to multiply languages in this way: dependent type theory is flexible and expressive, and there is no reason we cannot represent assertions and proofs in the same general framework.
ko: 그러나 의존유형론은 유연하고 표현력 있어 이런 식으로 언어들을 늘릴 이유는 없습니다. 그리고 주장과 증명은 한 동일한 일반적 프레임워크에서 표현하지 못할 이유도 없습니다.

source: But there is a function Int.ofNat that embeds the natural numbers in the integers, meaning that we can view any natural number as an integer, when needed.
ko: 그러나 정수에 자연수가 내장되도록 하는 Int.ofNat 함수가 있어서 필요할 때 임의의 자연수를 정수로 볼 수 있게 합니다.

source: But they can also be shorter and easier to write.
ko: 그러나 그것들은 더 짧고 더 쓰기 쉬울 수 있습니다.

source: But this transforms the goal into b * c * a = a * (c * b), after commuting the very first multiplication appearing in the term.
ko: 그러나 이것은 항에 나타나는 맨 처음 곱셈을 교환한 뒤 목표를 b * c * a = a * (c * b)로 바꿉니다.

source: But this fails with a frustrating
ko: 그러나 이것은 좌절과 함께 실패합니다.

source: But this information is redundant: one can infer the argument α in Lst.cons Nat 5 (Lst.nil Nat) from the fact that the second argument, 5, has type Nat.
ko: 그러나 이 정보는 중복적입니다. Lst.cons Nat 5 (Lst.nil Nat)에서 두번째 인수 5가 Nat 유형을 가진다는 사실로부터 인수 α를 추론할 수 있습니다.

source: But using reverse_mk_symm is generally the right thing to do, and it would be nice if users did not have to invoke it explicitly.
ko: 하지만 reverse_mk_symm을 사용하는 것은 일반적으로 해야 하는 것입니다. 그리고 사용자가 이를 명시적으로 불러올 필요가 없다면 좋을 것입니다.

source: But using the type annotations in the longer version makes the proof more readable, and can help catch and debug errors.
ko: 하지만 더 긴 버전의 유형 주석을 사용하는 것은 증명을 더 가독성있게 하 에러를 잡고 고치는 걸 도와줍니다.

source: But using type class inference (see Chapter Type Classes), Lean can actually find the relevant decision procedure, which means that you can use the case split in a computable function.
ko: 그러나 유형 클래스 추론을 사용하여 (유형 클래스 장 참조), 린이 실제로 연관된 결정 절차를 찾을 수 있다. 이 말은 여러분이 셀 수 있는 함수에 대해 경우를 나누는 것이 가능하다는 의미이다.

source: But we can prove that certain propositions are decidable.
ko: 그래도 우리는 특정 명제가 결정 가능임을 증명할 수 있습니다.

source: But we can still write h.elim instead of Or.elim h:
ko: 그러나 우리는 여전히 Or.elim h대신 h.elim와 같이 쓸 수 있습니다.

source: But we will not need to use such inaccessible patterns before Section Dependent Pattern Matching.
ko: 그러나 우리는 의존적인 패턴 매칭 섹션 전까지 그런 접근할 수 없는 패턴을 사용할 필요는 없을 것입니다.

source: But what type should cons have?
ko: 그러나 cons는 어떤 유형을 가져야 할까요?

source: But what value should we return in the nil case?
ko: 그러나 nil 경우에 우리가 돌려줘야 하는 값은 무엇인가요?

source: But you can replace an arbitrary expression in the goal by a fresh variable using the generalize tactic.
ko: 하지만 여러분은 목표 속 임의의 표현식을 generalize 전략을 사용해 새 변수로 대체할 수 있습니다.

source: But, in fact, a case split is not required on the first argument; the casesOn eliminator for Vector automatically abstracts this argument and replaces it by 0 and n + 1 when we do a case split on the second argument.
ko: 그러나 사실 경우 분할은 첫 번째 인수에 대해 필요하지 않습니다. 두 번째 인수에 대해 경우를 나누었을 때 Vector를 위한 casesOn 제거자가 자동적으로 이 인수를 추출하고 그것을 0과 n + 1으로 대체합니다.

source: But, more importantly, equational reasoning is supported by a term rewriter, a simplifier, and other kinds of automation.
ko: 그러나 더 중요한 것은 방정식적인 추론은 항 다시쓰기, 단순화, 그리고 여타의 자동화에서도 지원된다는 점 입니다.

source: By default, simp includes all theorems that have been marked with the attribute [simp].
ko: 기본적으로 simp은 [simp] 특성으로 표시한 모든 정리를 포함합니다.

source: By default, rw uses an equation in the forward direction, matching the left-hand side with an expression, and replacing it with the right-hand side.
ko: 기본적으로 rw은 표현식의 좌변과 일치하면 좌변을 우변으로 대체하여 앞방향으로 방정식을 사용합니다.

source: By default, Lean only tries to synthesize an instance Inhabited T when the term T is known and does not contain missing parts.
ko: 항 T는 알려져 있고 모르는 부분이 없을 때 기본적으로 린은 Inhabited T 개체만 합성하려고 합니다.

source: By default, it includes the standard library directory, and (in some contexts) the root of the user's local project.
ko: 기본적으로 이는 표준 라이브러리 경로와 (같은 맥락에서) 사용자의 로컬 프로젝트의 루트 경로를 포함합니다.

source: By default, the rewrite tactic affects only the goal.
ko: 기본적으로 rewrite 전략은 목표에만 영향을 미칩니다.

source: By design, the elements of an inductive type are freely generated, which is to say, the constructors are injective and have disjoint ranges.
ko: 설계하면서 귀납형의 원소는 자유롭게 생성됩니다. 그말은 생성자는 주입적이고 분리된 범위를 갖습니다.

source: By now, you have seen some ways of defining objects and functions in Lean.
ko: 지금까지, 여러분들은 린에서 객체와 함수를 정의하는 몇가지 방법을 배웠습니다.

source: By tagging the instance above with the attribute defaultInstance, we are instructing Lean to use this instance on pending type class synthesis problems.
ko: defaultInstance 속성으로 위의 개체를 표시함으로써 우리는 린에게 유형 클래스 합성 문제로 보류 중인 이 개체를 사용하라고 가르킵니다.

source: By the above considerations, if r is a well-founded relation on a type α, we should have a principle of well-founded recursion on α, with respect to the relation r.
ko: 위의 고려로부터 만약 r이 α형에 대해 잘 세워진 관계이면, 우리는 관계 r에 대해서 α에 대해 잘 세워진 재귀의 원리를 가져야 합니다.

source: By the end of this chapter, you will understand much of what this means.
ko: 2장의 끝에서 여러분은 이것의 의미하는 바의 대부분을 이해하게 될 겁니다.

source: By the previous observations, decide will succeed any time the inferred decision procedure for c has enough information to evaluate, definitionally, to the isTrue case.
ko: 전의 관찰로부터 decide는 c에 대한 추론된 결정 절차가 isTrue 사례에 대해 정의로부터 평가하기에 충분한 정보를 가질 때마다 성공할 것입니다.

source: By the propositions-as-types correspondence, this means that induction is the fundamental method of proof.
ko: 유형으로써 명제 대응에 따르면 이것은 귀납은 증명의 기초적인 방식임을 의미합니다.

source: Calculational Proofs
ko: 계산 증명

source: Chaining Instances
ko: 연결 개체

source: Choosing induction on the second argument, we might begin as follows:
ko: 두 번째 인수에 귀납을 선택하는 것으로 우리는 다음과 같이 시작할 수 있습니다.

source: Classical Logic
ko: 고전 논리

source: Coercions
ko: 강제 형 변환

source: Comment blocks can be nested, making it possible to "comment out" chunks of code, just as in many programming languages.
ko: 주석 블록은 중첩될 수 있으며 대부분의 프로그래밍 언어처럼 코드 조각을 "주석 처리"할 수 있게 합니다.

source: Comment headers at the top of each file provide additional information.
ko: 각 파일의 꼭대기에 도입부 주석은 추가 정보를 제공합니다.

source: Commutativity:
ko: 교환성:

source: Computer algebra systems and specialized mathematical software packages provide means of carrying out mathematical computations, establishing mathematical bounds, or finding mathematical objects.
ko: 컴퓨터 대수 시스템(CAS, Computer Algebra Systems)과 특정 수학 소프트웨어 패키지는 수학 계산을 수행하고 수학적 한계를 세우며, 수학적 대상을 찾는 수단을 줍니다.

source: Computers and Theorem Proving
ko: 컴퓨터와 정리 증명

source: Conceptually, stating a theorem or introducing a have statement creates a goal, namely, the goal of constructing a term with the expected type.
ko: 개념적으로, 정리를 진술하거나 have 문장을 도입하는 것은 예상되는 유형으로 항를 생성하는 목표를 만듭니다.

source: Conjunction
ko: 연결사

source: Consider one of the examples from the last section:
ko: 지난 섹션의 예제 중 하나를 고려해 봅시다.

source: Consider the "barber paradox," that is, the claim that in a certain town there is a (male) barber that shaves all and only the men who do not shave themselves.
ko: "이발사의 역설"을 고려해보세요. 즉, 그들 자신을 면도하지 않는 남자만 면도해 준다고 주장하는 어떤 마을의 (남자) 이발사의 주장입니다.

source: Consider the definitions of the product type and sum type in the library:
ko: 라이브러리에서 곱 유형의 정의와 합 유형의 정의를 고려해보세요.

source: Consider the following definition of the function Vector.add, which adds two vectors of elements of a type, assuming that type has an associated addition function:
ko: 유형의 원소의 두 벡터를 더하는 함수 Vector.add,의 다음 정의를 고려해보세요. 그 유형은 연관된 덧셈함수를 가지고 있다고 가정합니다.

source: Consider the following three function definitions:
ko: 다음 세 함수 정의를 생각해보세요.

source: Consider the following type of arithmetic expressions.
ko: 다음의 산술적 표현식 유형을 고려하세요.

source: Consider the inductively defined type of natural numbers.
ko: 자연수의 재귀적으로 정의된 유형을 고려해보세요.

source: Consider, for example, the addition function add m n on the natural numbers.
ko: 예를 들어 자연수에 대한 추가 함수 add m n을 고려해보세요.

source: Constructing such proofs typically requires much more input and interaction from users, but it allows you to obtain deeper and more complex proofs.
ko: 전형적으로 이런 증명을 작성하는 것은 사용자에게 훨씬 많은 입력과 상호작용을 요구합니다. 그러나 이것은 우리가 더 깊고 복잡한 증명을 얻을 수 있게 합니다.

source: Constructors with Arguments
ko: 인수를 가지는 생성자

source: Conversely, if you have p : Nat × Nat, then you can write p.1 : Nat and p.2 : Nat.
ko: 반대로 여러분이 p : Nat × Nat을 갖고 있다면 p.1 : Nat과 p.2 : Nat처럼 쓸 수 있습니다.

source: Conversely, the cases tactic can be used to decompose a disjunction.
ko: 반대로 cases 전략은 분리자를 분해하는데 사용할 수 있습니다.

source: Conversely, the proof of a mathematical theorem may require a lengthy computation, in which case verifying the truth of the theorem requires verifying that the computation does what it is supposed to do.
ko: 반대로 수학적 정리의 증명은 긴 계산이 필요하는데 이 경우 정리의 참을 증명하는 건 계산한 것을 증명하는 걸 필요로 합니다.

source: Conversely, when writing an arbitrary Lean term, you can always invoke the tactic mode by inserting a by block.
ko: 반대로 임의의 Lean 항을 작성했다면 by 블럭을 삽입하는 것으로 전략모드를 불러올 수 있습니다.

source: Creating a function from another expression is a process known as lambda abstraction.
ko: 다른 표현식으로부터 함수를 만드는 것은 람다 추상화(lambda abstraction)과정으로 알려져 있습니다.

source: Curly brackets and . can also be used in conv mode to structure tactics.
ko: 중괄호와 .은 전략을 구조화하기위해 conv 모드에서도 사용될 수 있습니다.

source: Decidable Propositions
ko: 결정 가능한 명제

source: Declaring Structures
ko: 구조체 선언하기

source: Declaring an "axiom" hp : p is tantamount to declaring that p is true, as witnessed by hp.
ko: "공리" hp : p를 선언하는 것은 hp에서 본 바와 같이 p가 참이라고 선언하는 것과 마찬가지입니다.

source: Declaring new objects in this manner is a good way to experiment with the system.
ko: 이처럼 새로운 대상을 선언하는 것은 시스템을 실험해보는 좋은 방식입니다.

source: Default instances
ko: 기본 개체

source: Define an inductive data type consisting of terms built up from the following constructors:
ko: 다음 생성자로부터 세워진 항으로 구성된 유도 데이터 형을 정의하세요.

source: Define some operations on lists, like a length function or the reverse function.
ko: 리스트에 대한 length함수나 reverse 함수같은 몇 가지 연산을 정의하세요.

source: Define your own function to carry out course-of-value recursion on the natural numbers.
ko: 자연수에 대해 재귀의 과정(course-of-value recursion)을 수행하는 여러분만의 함수를 정의하세요.

source: Defining the Natural Numbers
ko: 자연수를 정의하기

source: Definition
ko: 정의(Definition)

source: Definitions
ko: 정의(Definitions)

source: Dependent Pattern Matching
ko: 의존적 패턴 매칭

source: Dependent products are also called sigma types, and you can also write them as Σ a : α, β a.
ko: 의존적 곱은 sigma유형이라고 불립니다. 그리고 여러분은 그것을 Σ a : α, β a처럼 쓸 수 있습니다.

source: Dependent type theory is a powerful and expressive language, allowing you to express complex mathematical assertions, write complex hardware and software specifications, and reason about both of these in a natural and uniform way.
ko: 의존 유형론은 여러분이 복잡한 수학적 진술을 표현할 수 있게 하고, 복잡한 하드웨어와 소프트웨어 명제를 작성할 수 있게 하며 이 둘에 대해 자연스럽고 일관성있게 추론할 수 있게 하는 강력하고 표현력 있는 언어입니다.

source: Dependent type theory is powerful enough to encode and justify well-founded recursion.
ko: 종속 유형론은 잘 세워진 재귀를 부호화하고 정당화하기에 충분히 강력합니다.

source: Despite the different placement of the parameter α in these two examples, in both cases it treated in the same way, in that it does not participate in a case split.
ko: 이 두 예제에서 매개변수 α의 다른 배치에도 불구하고 두 경우 모두 같은 방식으로 다뤄집니다. 그러므로 이것은 경우 분할에 참여하지 않습니다.
